dm-materials/material-guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-11 Fri 10:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Material Guide</title>
<meta name="author" content="zfoteff" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/stylesheets/default-style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Material Guide</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org82756d4">1. Cosmic</a></li>
<li><a href="#orgdb73812">2. Brimstone</a></li>
<li><a href="#org52b9b36">3. Meteor</a></li>
<li><a href="#orgc977652">4. Mithryl</a></li>
<li><a href="#orgb6b968c">5. Deep crystal</a></li>
<li><a href="#org183de57">6. Dwarven Smelt</a></li>
<li><a href="#orge25c72e">7. Steel</a></li>
<li><a href="#org81a4ce9">8. Iron</a></li>
<li><a href="#orgc672c41">9. Stone</a></li>
<li><a href="#org9711846">10. Wooden</a></li>
</ul>
</div>
</div>
<div class="org-center">
<p>
[ <a href="dm.html#ID-49c009a8-dbe3-4867-a616-60c55d87ed54">DM Menu</a> ]
</p>
</div>
<hr />
<p>
Material list [high to low]: cosmic -&gt; meteor, mithryl -&gt; iron -&gt; stone -&gt; wooden
</p>

<div id="outline-container-org82756d4" class="outline-2">
<h2 id="org82756d4"><span class="section-number-2">1.</span> Cosmic</h2>
<div class="outline-text-2" id="text-1">
<p>
Highest tier. Highest damage potential, high critical damage chance, and will shatter the minds of weaker enemies who cannot comprehend the madness of the cosmos. Must be wielded by a highly skilled individual to ensure that wielding the weapon does not cause the user to go mad. The user will have to fight off the effects of the weapon as they use it, limiting the material to high level characters.
Deals Chaos, Cosmic, and Madness damage to enemies
</p>
</div>
</div>
<div id="outline-container-orgdb73812" class="outline-2">
<h2 id="orgdb73812"><span class="section-number-2">2.</span> Brimstone</h2>
<div class="outline-text-2" id="text-2">
<p>
Material crafted from the dregs of Hell. Exceedingly rare.
</p>

<p>
Deals <a href="damage-guide.html#ID-23919bd5-7bb0-4743-ae81-f07566ccd236">madness</a> and <a href="damage-guide.html#ID-23919bd5-7bb0-4743-ae81-f07566ccd236">fire</a> damage to enemies
</p>
</div>
</div>
<div id="outline-container-org52b9b36" class="outline-2">
<h2 id="org52b9b36"><span class="section-number-2">3.</span> Meteor</h2>
<div class="outline-text-2" id="text-3">
<p>
Metal salvaged from falling meteors. Its strange magical qualities result in extremely effective weapons.
</p>

<p>
Deals fire and radiance damage
</p>
</div>
</div>
<div id="outline-container-orgc977652" class="outline-2">
<h2 id="orgc977652"><span class="section-number-2">4.</span> Mithryl</h2>
<div class="outline-text-2" id="text-4">
<p>
Elven metal. Cool stuff.
</p>

<p>
Deals <a href="damage-guide.html#ID-23919bd5-7bb0-4743-ae81-f07566ccd236">cold</a> and <a href="damage-guide.html#ID-23919bd5-7bb0-4743-ae81-f07566ccd236">radiance</a> damage
</p>
</div>
</div>
<div id="outline-container-orgb6b968c" class="outline-2">
<h2 id="orgb6b968c"><span class="section-number-2">5.</span> Deep crystal</h2>
</div>
<div id="outline-container-org183de57" class="outline-2">
<h2 id="org183de57"><span class="section-number-2">6.</span> Dwarven Smelt</h2>
<div class="outline-text-2" id="text-6">
<p>
A strange mix of metals, crafted with skilled hands into reliable and strong weapons. Their composition gives their weapons a unique resonance, generating an electrical field when attacking enemies.
</p>

<p>
Deals <a href="damage-guide.html#ID-23919bd5-7bb0-4743-ae81-f07566ccd236">shock</a> damage
</p>
</div>
</div>
<div id="outline-container-orge25c72e" class="outline-2">
<h2 id="orge25c72e"><span class="section-number-2">7.</span> Steel</h2>
<div class="outline-text-2" id="text-7">
<p>
The standard. Lighter than iron, more flexible than iron, and far stronger than . An adventurers best choice of weapon.
</p>
</div>
</div>
<div id="outline-container-org81a4ce9" class="outline-2">
<h2 id="org81a4ce9"><span class="section-number-2">8.</span> Iron</h2>
<div class="outline-text-2" id="text-8">
<p>
Heavy smelted iron, especially strong and tough. Just don&rsquo;t leave them in water.
</p>
</div>
</div>
<div id="outline-container-orgc672c41" class="outline-2">
<h2 id="orgc672c41"><span class="section-number-2">9.</span> Stone</h2>
<div class="outline-text-2" id="text-9">
<p>
The caveman special. Effective bludgeoning weapons, and sharp enough rocks may even cut opponents!
</p>
</div>
</div>
<div id="outline-container-org9711846" class="outline-2">
<h2 id="org9711846"><span class="section-number-2">10.</span> Wooden</h2>
<div class="outline-text-2" id="text-10">
<p>
Gotta start somewhere. Grab a branch and start swinging!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-07-06 Thu 00:00</p>
<p class="author">Author: zfoteff</p>
<p class="date">Created: 2023-08-11 Fri 10:20</p>
</div>
</body>
</html>